Revit 2027 API
RevitLinkType.GetConversionData Method
 Returns the optional data that is necessary to generate the Revit file for this link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkConversionData GetConversionData()
Public Function GetConversionData As LinkConversionData
public:
LinkConversionData^ GetConversionData()
member GetConversionData : unit -> LinkConversionData
Return Value
LinkConversionData
 The RvtLinkConversionData containing the necessary information.
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace